import AuthContainer from "@/components/container/AuthContainer"

const TermPage = () => {
    const title = { label: "隱私權聲明" }
    return (
        <AuthContainer title={title}>
            <div className="p-6">
                歡迎您瀏覽和使用本網站，安心食品服務股份有限公司 (以下稱「MOS」)為保護 您在本網站提供的個人資訊隱私，謹說明MOS可能蒐集、使用 您個人資料之相關情況及其範圍如下。如果您無法接受或遵守本頁相關條款，請您停止瀏覽及使用本網站。請注意如您繼續瀏覽或使用本網站， 您將被視為接受和同意遵守這些條款。

                個人資料之蒐集
                您可自願選擇在本網站上加入成為 MOS 會員或是參加 MOS 舉辦的網路活動或線上抽獎活動等，MOS 會從您自願加入會員或參加網路線上活動所填寫上傳的申請表中獲得您的個人資料，包括姓名、出生年月日、性別、地址、電話、電子郵件信箱等項目及 您提供之其他個人資料但不以為限。

                當您進入本網站，本網站之伺服器會自動經由 IP 網址辨識您所使用電腦之位置，且本網站將使用 您的 IP 網址綜合進行使用趨勢分析、網站管理、記錄使用者變化及擴充統計資訊。且本網站將使用一般商業網站均會使用之 Cookies 這項工具，提供一個小容量之 Text 檔案於 您所使用電腦中，用以辨識重複使用本網站之訪客。如果您不欲MOS使用Cookies此項工具，建議 您可以經由瀏覽器設定、取消或限制此項工具。取消方式如下：

                請注意如 您未經由瀏覽器設定、取消或限制 Cookies 此項工具，您將被視為接受和同意 MOS 進行前揭行為。

                MOS 使用個人資料之狀況
                MOS 可能於下列狀況下使用您的個人資料：瞭解本網站使用者情況並用以提升本網站之功能；提供MOS會員服務之需給付得獎獎金或獎品；對於參加 MOS 舉辦的網路線上活動者進行活動相關通知及資料分析；邀請您參加 MOS 活動或進行市場調查、問卷、意見反應；提供 您 MOS 及關係企業之資訊及銷售產品消息等。

                此外，在您提供個人資料時，本網站將同時徵詢您是否有意願收到 MOS 或 MOS 相關企業及商業夥伴之相關訊息，如您同意者，MOS將不定時提供相關訊息至您所提供之電子郵件信箱。嗣後，如您不欲繼續收到 MOS 相關訊息， 您可立即 email 至 member @mos.com.tw，通知 MOS 停止繼續提供該等要約、問卷、行銷資料或其他資料。MOS 將於收到通知後，將依據 您的指示停止提供。

                MOS 分享個人資料之對象
                MOS 為東元集團之一員，其旗下關係企業包括東元家電(TECO)、摩斯漢堡(MOS) 、樂雅樂(Royal Host)等餐飲品牌及其關聯企業。MOS 於本網站上所取得之個人資料及其他訊息將視業務需要與東元集團現在及未來集團成員分享。再者，如有下述情形之一時，您亦同意 MOS得揭露 您的個人資料並無須於事前告知您： （1）依法院、檢察署、主管機關等之命令、傳票、行政調查或其他依法令之要求者； （2）為遵守相關法律程序或政府要求； （3）為確認及聯繫對於可能違反本網站隱私權聲明或網站使用須知之人或對其採取法律行動，或者為確認及聯繫損害 MOS 或他人權利或對 MOS 或他人之其他財產或利益造成損害或妨礙之人，或對其採取法律行動； (4) 有公司併購或相似情事發生者，及(5) 與 MOS 關係企業或其他商業夥伴間共同提升網站技術或共同辦理特定促銷或行銷活動者及 / 或 （6）為保障 MOS、本網站參訪者及公眾之權利、財產及安全時。除此之外，MOS 不會向前揭公司、對象或伙伴以外之任何第三人透露您的個人資料。

                個人資料之修正或停止使用
                如您的個人資料有下列需求時，請隨時 email至 member @mos.com.tw 與 MOS 聯繫處理：(1) 欲瞭解目前個人資料狀況；(2) 個人資料發生變動或有錯誤之情事；(3) 有其他修改個人資料之需求，及(4) 欲要求 MOS 停止使用或刪除個人資料者。

                個人資料之安全維護措施
                MOS 就依法保有之個人資料，將依相關法令辦理安全維護事項，以防止個人資料被竊取、竄改、毀損、滅失或洩漏。

                MOS 將盡力採取合理措施保障您個人資料之安全性，並遵循本隱私權聲明。但提請您注意，在任何情況下提供個人資料予他人均有風險，且無任何系統或技術可以保證百分之百安全或可防止駭客入侵，請小心使用您的軟體和設備，本網站不承擔因您進入或使用本網站而導致的任何直接的、間接的、意外的、因果性之損害賠償或損失補償責任；MOS可能為因應相關活動所需而於網站中提供本網站以外之其他網站網址或連結，關於該等網站中之相關隱私權保護措施，請參考該等網站之隱私權保護之相關聲明條款，MOS將不為該等網站的隱私權保護措施負責或對渠安全性背書。

                非個人資料之蒐集
                就您傳送至本網站個人資料以外的任何其他通訊或材料，包括但不限於意見、客戶回應、喜好、建議、支持、請求、問題等內容（以下簡稱「其他訊息」），將被當作非保密資料和非專有資料處理；而當 您將這些其他訊息傳送至本網站並被接收時，即被視為 您同意並無償將其他訊息授權MOS、MOS關係企業或商業夥伴為調查、統計等使用。

                兒童個人資料保護
                本網站無意在未經兒童父母或未成年人之法定代理人同意前，向 12 歲以下兒童或未成年人蒐集任何個人資料，惟如任何十二歲以下兒童或未成年人自願於本網站加入會員或參加 MOS 相關網路活動時，MOS將因此取得該名兒童或未成年人所提供之姓名、地址及電話等會員或活動所需之資料（以下簡稱「兒童個人資料」）。關於所蒐集來的兒童個人資料，將僅限依據本隱私權聲明規定使用。MOS 提請家長對其子女在使用網際網路時個人訊息的使用進行監管和負責，如兒童或未成年人通過公告版或類似形式自願提供及公開的資料被他人使用或發放郵件，與本網站無關。

                MOS 保留變更及修改本隱私權聲明相關條款之權利，本隱私權聲明相關條款之變更修改將於本網站適當位置公告，請您定期查閱，MOS 不會再另行通知或提醒。
            </div>
        </AuthContainer>
    )
}

export default TermPage